## Assignment Week 7
### By Alexander Doler

#### Note that I had originally included NaN values in this dataframe, and replaced them with filled values but when performing mathematical operations, the columns that formerly contained NaN values did not behave as expected. For example, rather than summing the column values, the values were appened. So, for example, the sum() function would return "3454", instead of summing the values to equal "16". The lines of code that deal with the NaN values have been left commented out.
#### In this first cell the csv file is imported. We then rename the unnambed column as "Interviewee" and set it as the index of the dataframe.

In [209]:
import pandas as pd
import numpy as np

movies = pd.read_csv("https://raw.githubusercontent.com/aedoler/IS_362_Assignment_Week_7/master/Movies.csv")
movies = movies.rename(columns={"Unnamed: 0":"Interviewee"})
#movies = movies.replace(to_replace='None', value=np.nan)
movies = movies.set_index("Interviewee")
movies

,La La Land,Moonlight,Jackie,Finding Dory,Suicide Squad,Silence
Interviewee,,,,,,
Alex,2,4,4,5,3,4
Nico,2,3,4,3,3,4
Cain,5,3,4,5,2,2
Matias,3,4,2,5,3,4
Leandro,3,4,3,3,2,4
Manuel,2,5,4,3,3,4

#### In the two following cells we obtain the average ratings for each movie, and then for each interviewee.

In [210]:
movies.mean(axis=0)

La La Land       2.833333
Moonlight        3.833333
Jackie           3.500000
Finding Dory     4.000000
Suicide Squad    2.666667
Silence          3.666667
dtype: float64

In [211]:
movies.mean(axis=1)

Interviewee
Alex       3.666667
Nico       3.166667
Cain       3.500000
Matias     3.500000
Leandro    3.166667
Manuel     3.500000
dtype: float64

In [212]:
#long_movies = pd.melt(movies, id_vars=['Interviewee'], value_vars=['La La Land', 'Moonlight', 'Jackie', 'Finding Dory', 'Suicide Squad', 'Silence'], var_name='Movie', value_name='Rating')
#long_movies

In [213]:
#long_movies.Rating = long_movies.Rating.dropna().astype(np.int64)
#avg_rating = long_movies.groupby('Interviewee').agg(np.mean)
#avg_rating

In [214]:
#long_movies.groupby('Movie').mean()

In [215]:
#movies_filled = movies.fillna(method="ffill")
#movies_filled

#### In the cell below, we create a new dataframe with the normalized values.

In [220]:
norm_df = (movies - movies.min() / movies.max() - movies.min())
norm_df

,La La Land,Moonlight,Jackie,Finding Dory,Suicide Squad,Silence
Interviewee,,,,,,
Alex,-0.4,0.4,1.5,1.4,0.333333,1.5
Nico,-0.4,-0.6,1.5,-0.6,0.333333,1.5
Cain,2.6,-0.6,1.5,1.4,-0.666667,-0.5
Matias,0.6,0.4,-0.5,1.4,0.333333,1.5
Leandro,0.6,0.4,0.5,-0.6,-0.666667,1.5
Manuel,-0.4,1.4,1.5,-0.6,0.333333,1.5

#### In the two cells below we obtain the average once again for both movies and interviewees, but using the normalized values.

In [217]:
norm_df.mean(axis=0)

La La Land       0.266667
Moonlight        0.066667
Jackie           0.625000
Finding Dory     0.200000
Suicide Squad   -0.222222
Silence          0.750000
dtype: float64

In [218]:
norm_df.mean(axis=1)

Interviewee
Alex       0.531019
Nico       0.031019
Cain       0.364352
Matias     0.364352
Leandro    0.031019
Manuel     0.364352
dtype: float64

#### In this cell we use the standardization formula to obtain the standardized values of the dataframe.

In [222]:
std_df = (norm_df - norm_df.mean()) / norm_df.std()
std_df

,La La Land,Moonlight,Jackie,Finding Dory,Suicide Squad,Silence
Interviewee,,,,,,
Alex,-0.712832,0.221404,0.597614,0.912871,0.645497,0.408248
Nico,-0.712832,-1.107019,0.597614,-0.912871,0.645497,0.408248
Cain,1.853364,-1.107019,0.597614,0.912871,-1.290994,-2.041241
Matias,0.142566,0.221404,-1.792843,0.912871,0.645497,0.408248
Leandro,0.142566,0.221404,-0.597614,-0.912871,-1.290994,0.408248
Manuel,-0.712832,1.549826,0.597614,-0.912871,0.645497,0.408248

### Conclusion

#### One of the main reasons for normalizing data is the set all the data on the same scale (0,1). It adjusts the data into a more linear format that can be more appropriate for performing data mining and analysis in some cases. Normalized data is great for finding patters and recognizing variances in the data. However, a disadvantage is that if there are outliers in the dataset, the outliers will cause the rest of the data to scale to a very low value, which may not represent the actual trends.